mateomartinovic/AS5050_sam4/Atmel.SAM4E_DFP.1.1.57/ic.sam4ecb/svd/ATSAM4E16CB.svd
        <register>
          <name>CMR2</name>
          <description>Channel Mode Register (channel = 2)</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCCLKS</name>
              <description>Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_CLOCK1</name>
                  <description>Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CLOCK2</name>
                  <description>Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CLOCK3</name>
                  <description>Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CLOCK4</name>
                  <description>Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_CLOCK5</name>
                  <description>Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC0</name>
                  <description>Clock selected: XC0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC1</name>
                  <description>Clock selected: XC1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC2</name>
                  <description>Clock selected: XC2</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKI</name>
              <description>Clock Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURST</name>
              <description>Burst Signal Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>The clock is not gated by an external signal.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC0</name>
                  <description>XC0 is ANDed with the selected clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC1</name>
                  <description>XC1 is ANDed with the selected clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XC2</name>
                  <description>XC2 is ANDed with the selected clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDBSTOP</name>
              <description>Counter Clock Stopped with RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDBDIS</name>
              <description>Counter Clock Disable with RB Loading</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETRGEDG</name>
              <description>External Trigger Edge Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>The clock is not gated by an external signal.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Each edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABETRG</name>
              <description>TIOA or TIOB External Trigger Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPCTRG</name>
              <description>RC Compare Trigger Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE</name>
              <description>Waveform Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDRA</name>
              <description>RA Loading Edge Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge of TIOA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge of TIOA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Each edge of TIOA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDRB</name>
              <description>RB Loading Edge Selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Rising edge of TIOA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Falling edge of TIOA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGE</name>
                  <description>Each edge of TIOA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBSMPLR</name>
              <description>Loading Edge Subsampling Ratio</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>Load a Capture Register each selected edge</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>Load a Capture Register every 2 selected edges</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTH</name>
                  <description>Load a Capture Register every 4 selected edges</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTH</name>
                  <description>Load a Capture Register every 8 selected edges</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEENTH</name>
                  <description>Load a Capture Register every 16 selected edges</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
