mateomartinovic/AS5050_sam4/Atmel.SAM4E_DFP.1.1.57/ic.sam4ecb/svd/ATSAM4E16CB.svd
        <register>
          <name>CHER</name>
          <description>DMAC Channel Handler Enable Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable [3:0]</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable [3:0]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable [3:0]</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUSP0</name>
              <description>Suspend [3:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUSP1</name>
              <description>Suspend [3:0]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUSP2</name>
              <description>Suspend [3:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SUSP3</name>
              <description>Suspend [3:0]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEEP0</name>
              <description>Keep on [3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEEP1</name>
              <description>Keep on [3:0]</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEEP2</name>
              <description>Keep on [3:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEEP3</name>
              <description>Keep on [3:0]</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHDR</name>
          <description>DMAC Channel Handler Disable Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DIS0</name>
              <description>Disable [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS1</name>
              <description>Disable [3:0]</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS2</name>
              <description>Disable [3:0]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIS3</name>
              <description>Disable [3:0]</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RES0</name>
              <description>Resume [3:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RES1</name>
              <description>Resume [3:0]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RES2</name>
              <description>Resume [3:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RES3</name>
              <description>Resume [3:0]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSR</name>
          <description>DMAC Channel Handler Status Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00FF0000</resetValue>
          <fields>
            <field>
              <name>ENA0</name>
              <description>Enable [3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENA1</name>
              <description>Enable [3:0]</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENA2</name>
              <description>Enable [3:0]</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENA3</name>
              <description>Enable [3:0]</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP0</name>
              <description>Suspend [3:0]</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP1</name>
              <description>Suspend [3:0]</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP2</name>
              <description>Suspend [3:0]</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP3</name>
              <description>Suspend [3:0]</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPT0</name>
              <description>Empty [3:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPT1</name>
              <description>Empty [3:0]</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPT2</name>
              <description>Empty [3:0]</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPT3</name>
              <description>Empty [3:0]</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAL0</name>
              <description>Stalled [3:0]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAL1</name>
              <description>Stalled [3:0]</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAL2</name>
              <description>Stalled [3:0]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STAL3</name>
              <description>Stalled [3:0]</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SADDR0</name>
          <description>DMAC Channel Source Address Register (ch_num = 0)</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SADDR</name>
              <description>Channel x Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DADDR0</name>
          <description>DMAC Channel Destination Address Register (ch_num = 0)</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DADDR</name>
              <description>Channel x Destination Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCR0</name>
          <description>DMAC Channel Descriptor Address Register (ch_num = 0)</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DSCR</name>
              <description>Buffer Transfer Descriptor Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA0</name>
          <description>DMAC Channel Control A Register (ch_num = 0)</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BTSIZE</name>
              <description>Buffer Transfer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRC_WIDTH</name>
              <description>Transfer Width for the Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_WIDTH</name>
              <description>Transfer Width for the Destination</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>the transfer size is set to 8-bit width</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_WORD</name>
                  <description>the transfer size is set to 16-bit width</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>the transfer size is set to 32-bit width</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE</name>
              <description>Current Descriptor Stop Command and Transfer Completed Memory Indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB0</name>
          <description>DMAC Channel Control B Register (ch_num = 0)</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC_DSCR</name>
              <description>Source Address Descriptor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FETCH_FROM_MEM</name>
                  <description>Source address is updated when the descriptor is fetched from the memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FETCH_DISABLE</name>
                  <description>Buffer Descriptor Fetch operation is disabled for the source.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_DSCR</name>
              <description>Destination Address Descriptor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FETCH_FROM_MEM</name>
                  <description>Destination address is updated when the descriptor is fetched from the memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FETCH_DISABLE</name>
                  <description>Buffer Descriptor Fetch operation is disabled for the destination.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC</name>
              <description>Flow Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEM2MEM_DMA_FC</name>
                  <description>Memory-to-Memory Transfer DMAC is flow controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEM2PER_DMA_FC</name>
                  <description>Memory-to-Peripheral Transfer DMAC is flow controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER2MEM_DMA_FC</name>
                  <description>Peripheral-to-Memory Transfer DMAC is flow controller</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER2PER_DMA_FC</name>
                  <description>Peripheral-to-Peripheral Transfer DMAC is flow controller</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC_INCR</name>
              <description>Incrementing, Decrementing or Fixed Address for the Source</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCREMENTING</name>
                  <description>The source address is incremented</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECREMENTING</name>
                  <description>The source address is decremented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>The source address remains unchanged</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DST_INCR</name>
              <description>Incrementing, Decrementing or Fixed Address for the Destination</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCREMENTING</name>
                  <description>The destination address is incremented</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECREMENTING</name>
                  <description>The destination address is decremented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>The destination address remains unchanged</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEN</name>
              <description>Interrupt Enable Not</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
